In [2]:
import sqlite3 as sql

In [3]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

In [4]:
%%sql
SELECT * FROM sqlite_master WHERE type='table';

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [40]:
%%sql
SELECT * 
FROM facts
WHERE name = "Italy"
LIMIT 5;

 * sqlite:///factbook.db
Done.

[(83, 'it', 'Italy', 301340, 294140, 7200, 61855120, 0.27, 8.74, 10.19, 4.1)]

In [9]:
%%sql
SELECT 
    MIN(population),
    MAX(population),
    MIN(population_growth),
    MAX(population_growth)
FROM facts;

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

In [10]:
%%sql
SELECT 
    *
FROM facts
ORDER BY population ASC
LIMIT 1;

 * sqlite:///factbook.db
Done.

[(198, 'at', 'Ashmore and Cartier Islands', 5, 5, 0, None, None, None, None, None)]

In [11]:
%%sql
SELECT 
    *
FROM facts
ORDER BY population DESC
LIMIT 1;

 * sqlite:///factbook.db
Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

In [45]:
%%sql
SELECT 
    AVG(population) population
FROM facts
WHERE name != 'World';

 * sqlite:///factbook.db
Done.

[(32242666.56846473,)]

In [46]:
%%sql
SELECT 
    AVG(area) average
FROM facts
WHERE name != 'World';

 * sqlite:///factbook.db
Done.

[(555093.546184739,)]

## Highest population densities (based on population and area)

In [49]:
%%sql
SELECT 
    name
FROM facts
WHERE population > 
(SELECT AVG(population)
FROM facts
WHERE name != 'World') 
AND area <
(SELECT AVG(area)
FROM facts
WHERE name != 'World')
LIMIT 10;

 * sqlite:///factbook.db
Done.

[('Bangladesh',),
 ('Germany',),
 ('Iraq',),
 ('Italy',),
 ('Japan',),
 ('Korea, South',),
 ('Morocco',),
 ('Philippines',),
 ('Poland',),
 ('Spain',)]

## Countries and territories with highest % of water area (water area as % of total area)

In [58]:
%%sql
SELECT
    name,
    ROUND(CAST(area_water AS FLOAT) / CAST(area AS FLOAT), 1) "perc_water_area"
FROM facts
ORDER BY perc_water_area DESC
LIMIT 10;

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory', 1.0),
 ('Virgin Islands', 0.8),
 ('Puerto Rico', 0.4),
 ('Bahamas, The', 0.3),
 ('Guinea-Bissau', 0.2),
 ('Malawi', 0.2),
 ('Netherlands', 0.2),
 ('Uganda', 0.2),
 ('Armenia', 0.1),
 ('Bangladesh', 0.1)]

## Projected 2016 populations based on 2015 data and anticpated growth

In [61]:
%%sql
SELECT
    name,
    ROUND(pop_2016 - population, 0) pop_growth
FROM
(SELECT
    name,
    population,
    CAST(population AS FLOAT) * (1+ (CAST(population_growth AS FLOAT) / 100)) pop_2016
FROM facts
WHERE name != 'World')
ORDER BY pop_growth DESC
LIMIT 10;

 * sqlite:///factbook.db
Done.

[('India', 15270686.0),
 ('China', 6153684.0),
 ('Nigeria', 4448270.0),
 ('Pakistan', 2906653.0),
 ('Ethiopia', 2874562.0),
 ('Bangladesh', 2703324.0),
 ('United States', 2506677.0),
 ('Indonesia', 2355142.0),
 ('Congo, Democratic Republic of the', 1944691.0),
 ('Philippines', 1626074.0)]

## Countries with Death Rate greater than Birth Rate

In [57]:
%%sql
SELECT
    name,
    ROUND(CAST(death_rate AS FLOAT) - CAST(birth_rate AS FLOAT), 1) death_over_birth_rate
FROM facts
WHERE death_over_birth_rate > 0
ORDER BY death_over_birth_rate DESC;

 * sqlite:///factbook.db
Done.

[('Bulgaria', 5.5),
 ('Serbia', 4.6),
 ('Latvia', 4.3),
 ('Lithuania', 4.2),
 ('Ukraine', 3.7),
 ('Hungary', 3.6),
 ('Germany', 3.0),
 ('Slovenia', 3.0),
 ('Romania', 2.8),
 ('Belarus', 2.7),
 ('Croatia', 2.7),
 ('Monaco', 2.6),
 ('Greece', 2.4),
 ('Saint Pierre and Miquelon', 2.3),
 ('Russia', 2.1),
 ('Estonia', 1.9),
 ('Portugal', 1.8),
 ('Japan', 1.6),
 ('Italy', 1.4),
 ('Bosnia and Herzegovina', 0.9),
 ('Czech Republic', 0.7),
 ('Moldova', 0.6),
 ('Poland', 0.4)]